import type { BlogItem } from "../types/blog.type";

import blog1 from "../assets/6aabc714e2a79.webp";
import blog2 from "../assets/260920175045_g3UDrxr4bz.webp";
import blog3 from "../assets/260920175752_kbpbDIIOGX.webp";

export const blogList: BlogItem[] = [
    {
        id: 1,
        title: "রাইড শেয়ারিংয়ে বদলে যাচ্ছে বাংলাদেশের শহুরে পরিবহন ব্যবস্থা",
        subTitle:
            "দৈনন্দিন যাতায়াত থেকে শুরু করে জরুরি ভ্রমণ—কীভাবে ডিজিটাল রাইড শেয়ারিং শহরবাসীর জীবন সহজ করেছে।",
        image: blog1,
        date: "Sep 15, 2026",
        slug: "রাইড-শেয়ারিংয়ে-বদলে-যাচ্ছে-বাংলাদেশের-শহুরে-পরিবহন-ব্যবস্থা",
    },
    {
        id: 2,
        title: "সিলেটের দর্শনীয় স্থান সমূহ, খাবার ও থাকার ব্যবস্থা",
        subTitle:
            "চা বাগান, রাতারগুল, জাফলং ও বিছনাকান্দির রূপ উপভোগের সেরা ভ্রমণ গাইড ও পরিবহন সুবিধা।",
        image: blog2,
        date: "Sep 20, 2026",
        slug: "সিলেটের-দর্শনীয়-স্থান-সমূহ-খাবার-ও-থাকার-ব্যবস্থা",
    },
    {
        id: 3,
        title: "নওগাঁর দর্শনীয় স্থান সমূহ, খাবার ও থাকার ব্যবস্থা",
        subTitle:
            "পাহাড়পুর বৌদ্ধ বিহার ও কুশুম্বা মসজিদসহ নওগাঁর প্রত্নতাত্ত্বিক দর্শনীয় স্থানের পূর্ণাঙ্গ তালিকা।",
        image: blog3,
        date: "Sep 20, 2026",
        slug: "নওগাঁর-দর্শনীয়-স্থান-সমূহ-খাবার-ও-থাকার-ব্যবস্থা",
    },
];
